app/controllers/posts_controller.rb

  def index
  	@posts = Post.all.order("created_at DESC") #arranges posts in DESCending order or ASCending order
---
SELECT "posts".* FROM "posts"  ORDER BY created_at DESC

  def update
	  if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Mushrooms are the best"], ["body", "I want to import mushrooms from Europe!"], ["updated_at", "2016-04-17 02:19:34.987495"], ["id", 3]]